import 'package:bloc/bloc.dart';

int? pageNum = 1;
int pageCounter = 0;
int ayatCounter = 0;
int signedPage = 1;
double quranOffset = 0;
double savedOffset1 = 0;
double savedOffset2 = 0;
bool isDark = false;
bool changePage = false;
bool showEdges = false;
String sauraName = '';
String gozName = '';
int gozNum = 1;
List pages = [];
List ayat = [];
List<String> searchedAyat = [];
List<String> sauraNames = [];
List<String> agzaaNames = [];

class MyBlocObserver extends BlocObserver {
  @override
  void onCreate(BlocBase bloc) {
    super.onCreate(bloc);
    print('onCreate -- ${bloc.runtimeType}');
  }

  @override
  void onChange(BlocBase bloc, Change change) {
    super.onChange(bloc, change);
    print('onChange -- ${bloc.runtimeType}, $change');
  }

  @override
  void onError(BlocBase bloc, Object error, StackTrace stackTrace) {
    print('onError -- ${bloc.runtimeType}, $error');
    super.onError(bloc, error, stackTrace);
  }

  @override
  void onClose(BlocBase bloc) {
    super.onClose(bloc);
    print('onClose -- ${bloc.runtimeType}');
  }
}

const Map<String, int> sauraPage = {
  "الفاتحة": 1,
  "البقرة": 2,
  "آل عمران": 50,
  "النساء": 77,
  "المائدة": 106,
  "الأنعام": 128,
  "الأعراف": 151,
  "الأنفال": 177,
  "التوبة": 187,
  "يونس": 208,
  "هود": 221,
  "يوسف": 235,
  "الرعد": 249,
  "ابراهيم": 255,
  "الحجر": 262,
  "النحل": 267,
  "الإسراء": 282,
  "الكهف": 293,
  "مريم": 305,
  "طه": 312,
  "الأنبياء": 322,
  "الحج": 332,
  "المؤمنون": 342,
  "النور": 350,
  "الفرقان": 359,
  "الشعراء": 367,
  "النمل": 377,
  "القصص": 385,
  "العنكبوت": 396,
  "الروم": 404,
  "لقمان": 411,
  "السجدة": 415,
  "الأحزاب": 418,
  "سبإ": 428,
  "فاطر": 434,
  "يس": 440,
  "الصافات": 446,
  "ص": 453,
  "الزمر": 458,
  "غافر": 467,
  "فصلت": 477,
  "الشوري": 483,
  "الزخرف": 489,
  "الدخان": 496,
  "الجاثية": 499,
  "الأحقاف": 502,
  "محمد": 507,
  "الفتح": 511,
  "الحجرات": 515,
  "ق": 518,
  "الذاريات": 520,
  "الطور": 523,
  "النجم": 526,
  "القمر": 528,
  "الرحمن": 531,
  "الواقعة": 534,
  "الحديد": 537,
  "المجادلة": 542,
  "الحشر": 545,
  "الممتحنة": 549,
  "الصف": 551,
  "الجمعة": 553,
  "المنافقون": 554,
  "التغابن": 556,
  "الطلاق": 558,
  "التحريم": 560,
  "الملك": 562,
  "القلم": 564,
  "الحاقة": 566,
  "المعارج": 568,
  "نوح": 570,
  "الجن": 572,
  "المزمل": 574,
  "المدثر": 575,
  "القيامة": 577,
  "الإنسان": 578,
  "المرسلات": 580,
  "النبأ": 582,
  "النازعات": 583,
  "عبس": 585,
  "التكوير": 586,
  "الإنفطار": 587,
  "المطففين": 587,
  "الإنشقاق": 589,
  "البروج": 590,
  "الطارق": 591,
  "الأعلي": 591,
  "الغاشية": 592,
  "الفجر": 593,
  "البلد": 594,
  "الشمس": 595,
  "الليل": 595,
  "الضحي": 596,
  "الشرح": 596,
  "التين": 597,
  "العلق": 597,
  "القدر": 598,
  "البينة": 598,
  "الزلزلة": 599,
  "العاديات": 599,
  "القارعة": 600,
  "التكاثر": 600,
  "العصر": 601,
  "الهمزة": 601,
  "الفيل": 601,
  "قريش": 602,
  "الماعون": 602,
  "الكوثر": 602,
  "الكافرون": 603,
  "النصر": 603,
  "المسد": 603,
  "الإخلاص": 604,
  "الفلق": 604,
  "الناس": 604
};

const Map<String, int> alAgzaaPages = {
  'الجزء الأول': 1,
  'الجزء الثاني': 22,
  'الجزء الثالث': 42,
  'الجزء الرابع': 62,
  'الجزء الخامس': 82,
  'الجزء السادس': 102,
  'الجزء السابع': 122,
  'الجزء الثامن': 142,
  'الجزء التاسع': 162,
  'الجزء العاشر': 182,
  'الجزء الحادي عشر': 202,
  'الجزء الثاني عشر': 222,
  'الجزء الثالث عشر': 242,
  'الجزء الرابع عشر': 262,
  'الجزء الخامس عشر': 282,
  'الجزء السادس عشر': 302,
  'الجزء السابع عشر': 322,
  'الجزء الثامن عشر': 342,
  'الجزء التاسع عشر': 362,
  'الجزء العشرون': 382,
  'الجزء الحادي والعشرون': 402,
  'الجزء الثاني والعشرون': 422,
  'الجزء الثالث والعشرون': 442,
  'الجزء الرابع والعشرون': 462,
  'الجزء الخامس والعشرون': 482,
  'الجزء السادس والعشرون': 502,
  'الجزء السابع والعشرون': 522,
  'الجزء الثامن والعشرون': 542,
  'الجزء التاسع والعشرون': 562,
  'الجزء الثلاثون': 582,
};

const List<int> onePageTwoSaura = [
  106,
  221,
  235,
  255,
  267,
  293,
  312,
  359,
  385,
  396,
  404,
  434,
  440,
  458,
  467,
  489,
  502,
  515,
  520,
  523,
  528,
  531,
  534,
  537,
  545,
  551,
  554,
  564,
  566,
  568,
  570,
  575,
  577,
  578,
  580,
  583,
  587,
  589,
  591,
  592,
  594,
  595,
  597,
  598,
];

const List<int> onePageThreeSaura = [596, 599, 600, 601, 602, 603, 604];
